DSMComms/bin/bhldr.registerInfo.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:bhldr="http://tempuri.org/bhldr.xsd">
 <SOAP-ENV:Body>
  <bhldr:registerInfo>
   <inputInfo>
    <infoName>TEST INFO2</infoName>
    <value>2.110</value>
    <timestamp>1223</timestamp>
    <dataType>ANALOG</dataType>
   </inputInfo>
   <inputInfo>
    <infoName>TEST INFO3</infoName>
    <value>3.110</value>
    <timestamp>3333</timestamp>
    <dataType>ANALOG</dataType>
   </inputInfo>
  </bhldr:registerInfo>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
